terraform apply output during creation:
  # module.skeleton.module.influx[0].aiven_influxdb.this will be created
  + resource "aiven_influxdb" "this" {
      + cloud_name              = "azure-westeurope"
      + components              = (known after apply)
      + disk_space_cap          = (known after apply)
      + disk_space_default      = (known after apply)
      + disk_space_step         = (known after apply)
      + disk_space_used         = (known after apply)
      + id                      = (known after apply)
      + influxdb                = (known after apply)
      + maintenance_window_dow  = "tuesday"
      + maintenance_window_time = "01:30:00"
      + plan                    = "startup-4"
      + project                 = "bosch-4501"
      + service_host            = (known after apply)
      + service_name            = "influx-perf32"
      + service_password        = (sensitive value)
      + service_port            = (known after apply)
      + service_type            = "influxdb"
      + service_uri             = (sensitive value)
      + service_username        = (known after apply)
      + state                   = (known after apply)
      + termination_protection  = false

      + influxdb_user_config {
          + ip_filter_string = []
        }
    }

module.skeleton.module.influx[0].aiven_influxdb.this: Still creating... [1m40s elapsed]
module.skeleton.module.influx[0].aiven_influxdb.this: Still creating... [1m50s elapsed]
module.skeleton.module.influx[0].aiven_influxdb.this: Still creating... [2m0s elapsed]
module.skeleton.module.influx[0].aiven_influxdb.this: Still creating... [2m10s elapsed]
module.skeleton.module.influx[0].aiven_influxdb.this: Still creating... [2m20s elapsed]
module.skeleton.module.influx[0].aiven_influxdb.this: Still creating... [2m30s elapsed]
module.skeleton.module.influx[0].aiven_influxdb.this: Still creating... [2m40s elapsed]
module.skeleton.module.influx[0].aiven_influxdb.this: Still creating... [2m50s elapsed]
module.skeleton.module.influx[0].aiven_influxdb.this: Still creating... [3m0s elapsed]
module.skeleton.module.influx[0].aiven_influxdb.this: Still creating... [3m10s elapsed]
module.skeleton.module.influx[0].aiven_influxdb.this: Still creating... [3m20s elapsed]
module.skeleton.module.influx[0].aiven_influxdb.this: Still creating... [3m30s elapsed]
module.skeleton.module.influx[0].aiven_influxdb.this: Still creating... [3m40s elapsed]
module.skeleton.module.influx[0].aiven_influxdb.this: Still creating... [3m50s elapsed]
module.skeleton.module.influx[0].aiven_influxdb.this: Still creating... [4m0s elapsed]
module.skeleton.module.influx[0].aiven_influxdb.this: Still creating... [4m10s elapsed]
module.skeleton.module.influx[0].aiven_influxdb.this: Still creating... [4m20s elapsed]
module.skeleton.module.influx[0].aiven_influxdb.this: Still creating... [4m30s elapsed]
module.skeleton.module.influx[0].aiven_influxdb.this: Still creating... [4m40s elapsed]
module.skeleton.module.influx[0].aiven_influxdb.this: Still creating... [4m50s elapsed]
module.skeleton.module.influx[0].aiven_influxdb.this: Still creating... [5m0s elapsed]
module.skeleton.module.influx[0].aiven_influxdb.this: Still creating... [5m10s elapsed]
module.skeleton.module.influx[0].aiven_influxdb.this: Still creating... [5m20s elapsed]
module.skeleton.module.influx[0].aiven_influxdb.this: Still creating... [5m30s elapsed]
module.skeleton.module.influx[0].aiven_influxdb.this: Still creating... [5m40s elapsed]
module.skeleton.module.influx[0].aiven_influxdb.this: Still creating... [5m50s elapsed]
module.skeleton.module.influx[0].aiven_influxdb.this: Still creating... [6m0s elapsed]
module.skeleton.module.influx[0].aiven_influxdb.this: Still creating... [6m10s elapsed]
╷
│ Error: unable to copy api response into terraform schema: invalid terraform state type: expected map[string]interface{}
│ 
│   with module.skeleton.module.influx[0].aiven_influxdb.this,
│   on .terraform/modules/skeleton.influx/main.tf line 1, in resource "aiven_influxdb" "this":
│    1: resource "aiven_influxdb" "this" {
│ 
╵
##[error]Script failed with exit code: 1
